TRANSMISSION_CHOICES = (
    ("دستی", "دستی"),
    ("اتوماتیک", "اتوماتیک"),
)
FUEL_TYPE_CHOICES = (
    ("بنزین", "بنزین"),
    ("گازوئیل", "گازوئیل"),
    ("هیبریدی", "هیبریدی"),
    ("برقی", "برقی"),
    ("دوگانه کارخانه", "دوگانه کارخانه"),
    ("دوگانه دستی", "دوگانه دستی"),
)
STATUS_CHOICES = (
    ("active", "فعال"),
    ("inactive", "غیرفعال"),
    ("pending", "در حال بررسی"),
    ("expired", "منقضی شده"),
)
BODY_TYPE_CHOICES = (
    ("سدان", "سدان"),
    ("هاچ‌بک", "هاچ‌بک"),
    ("کراس‌اوور", "کراس‌اوور"),
    ("SUV", "SUV"),
    (" وانت", "وانت"),
    ("کامیون", "کامیون"),
    ("تجهیزات", "تجهیزات"),
)
CAR_TYPE_CHOICES = (
    ("سواری", "سواری"),
    ("موتورسیکلت", "موتورسیکلت"),
    ("اتوبوس", "اتوبوس"),
    ("ماشین‌آلات سنگین", "ماشین‌آلات سنگین"),
)
BRAND_TYPE_CHOICES = (
    ("سواری", "سواری"),
    ("موتورسیکلت", "موتورسیکلت"),
    ("ماشین‌آلات سنگین", "ماشین‌آلات سنگین"),
)
BODY_CONDITION_CHOICES = (
    ("بدون رنگ", "بدون رنگ"),
    ("صافکاری بدون رنگ", "صافکاری بدون رنگ"),
    ("یه لکه رنگ", "یه لکه رنگ"),
    ("دو لکه رنگ", "دو لکه رنگ"),
    ("سه لکه رنگ", "سه لکه رنگ"),
    ("چند لکه رنگ", "چند لکه رنگ"),
    ("کامل رنگ", "کامل رنگ"),
    ("دور رنگ", "دور رنگ"),
    ("تصادفی", "تصادفی"),
    ("اتاق تعویض", "اتاق تعویض"),
    ("سوخته", "سوخته"),
    ("اوراقی", "اوراقی"),
)

CHASSIS_CONDITION_CHOICES = (
    ("ضربه خورده", "ضربه خورده"),
    ("سالم", "سالم"),
    ("رنگ شده", "رنگ شده")
)
TIRE_CONDITION_CHOICES = [
    ('new', 'نو'),
    ('good', 'خوب'),
    ('worn', 'فرسوده'),
]

UPHOLSTERY_CONDITION_CHOICES = [
    ('leather', 'روکش چرم'),
    ('none', 'بدون روکش'),
    ('fabric', 'روکش پارچه ای'),
]
SALE_OR_RENT_CHOICES = [
    ('sale', 'فروشی'),
    ('rent', 'اجاره‌ای'),
]
BRAND_PARENT_CHOICES = [
    ("سواری", "سواری"),
    ("موتورسیکلت", "موتورسیکلت"),
    ("ماشین‌آلات سنگین", "ماشین‌آلات سنگین"),
]
