TRANSMISSION_CHOICES = (
    ("دستی", "دستی"),
    ("اتوماتیک", "اتوماتیک"),
)
FUEL_TYPE_CHOICES = (
    ("بنزین", "بنزین"),
    ("گازوئیل", "گازوئیل"),
    ("هیبریدی", "هیبریدی"),
    ("برقی", "برقی"),
)
STATUS_CHOICES = (
    ("active", "فعال"),
    ("inactive", "غیرفعال"),
    ("pending", "در حال بررسی"),
    ("expired", "منقضی شده"),
)
BODY_TYPE_CHOICES = (
    ("سدان", "سدان"),
    ("هاچ‌بک", "هاچ‌بک"),
    ("کراس‌اوور", "کراس‌اوور"),
    ("SUV", "SUV"),
    (" وانت", "وانت"),
    ("کامیون", "کامیون"),
)
CAR_TYPE_CHOICES = (
    ("سواری", "سواری"),
    ("موتورسیکلت", "موتورسیکلت"),
    ("کامیون", "کامیون"),
    ("اتوبوس", "اتوبوس"),
    ("ماشین‌آلات سنگین", "ماشین‌آلات سنگین"),
)